In [1]:
import pandas as pd
url = 'sample_superstore_data.csv'
df = pd.read_csv(url)
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,State,Region,Category,Sub-Category,Sales,Quantity,Discount,Profit
0,1,CA-2020-000001,01/03/2020,06/03/2020,Standard Class,CG-12100,Customer 0,Consumer,United States,New York,New York,East,Furniture,Chairs,45.98,2,0.00,12.34
1,2,CA-2020-000002,01/03/2020,06/03/2020,Standard Class,CG-12101,Customer 1,Consumer,United States,New York,New York,East,Furniture,Chairs,1199.99,5,0.15,299.99
2,3,CA-2020-000003,01/03/2020,06/03/2020,Standard Class,CG-12102,Customer 2,Consumer,United States,New York,New York,East,Furniture,Chairs,56.45,3,0.00,-15.67
3,4,CA-2020-000004,01/03/2020,06/03/2020,Standard Class,CG-12103,Customer 3,Consumer,United States,New York,New York,East,Furniture,Chairs,899.99,1,0.20,179.99
4,5,CA-2020-000005,01/03/2020,06/03/2020,Standard Class,CG-12104,Customer 4,Consumer,United States,New York,New York,East,Furniture,Chairs,234.56,4,0.10,58.64

In [13]:
df.groupby(['Category'])['Sales'].mean()

Category
Furniture          549.436364
Office Supplies    564.922121
Technology         568.316765
Name: Sales, dtype: float64

In [15]:
df.groupby(['Category'])['Sales'].agg(['mean','std','min','max'])

                       mean         std    min      max
Category
Furniture        549.436364  485.253716  45.98  1456.78
Office Supplies  564.922121  462.541742  45.98  1456.78
Technology       568.316765  481.469709  45.98  1456.78

In [16]:
df.groupby('Category').agg({
    'Sales': ['sum', 'mean', 'count'],
    'Profit': ['sum', 'mean'],
    'Quantity': ['sum', 'mean']
})

                    Sales                     Profit             Quantity  \
                      sum        mean count      sum        mean      sum
Category
Furniture        18131.40  549.436364    33  4282.07  129.759697      106
Office Supplies  18642.43  564.922121    33  4393.77  133.144545      103
Technology       19322.77  568.316765    34  4608.86  135.554706      111


                     mean
Category
Furniture        3.212121
Office Supplies  3.121212
Technology       3.264706

In [23]:
# Sub-CategoryÎ≥Ñ ÌèâÍ∑† Îß§Ï∂ú (ÏÉÅÏúÑ 3Í∞ú):"
df.groupby(['Sub-Category'])['Sales'].mean().sort_values(ascending=False).head(3)

Sub-Category
Accessories    583.347059
Paper          578.636667
Chairs         560.966000
Name: Sales, dtype: float64

In [35]:
# Í∞Å CategoryÎ≥Ñ Sales ÏÉÅÏúÑ 3Í∞ú Ï†úÌíà
imsi = df.groupby(['Category'])['Sales'].nlargest(3)
imsi['Furniture']

6     1456.78
16    1456.78
26    1456.78
Name: Sales, dtype: float64

In [37]:
print("\nüìä RegionÍ≥º CategoryÎ≥Ñ ÌèâÍ∑† Îß§Ï∂ú:")
pivot_table = df.pivot_table(
    values='Sales',
    index='Region',
    columns='Category',
    aggfunc='mean'
)
pivot_table

üìä RegionÍ≥º CategoryÎ≥Ñ ÌèâÍ∑† Îß§Ï∂ú:

Category  Furniture  Office Supplies  Technology
Region
Central         NaN       545.345625  547.862222
East      546.25160              NaN         NaN
South           NaN              NaN  575.680400
West      559.38875       583.347059         NaN

In [39]:
df[(df.Region == 'Central') & (df.Category == 'Furniture')]

Empty DataFrame
Columns: [Row ID, Order ID, Order Date, Ship Date, Ship Mode, Customer ID, Customer Name, Segment, Country, City, State, Region, Category, Sub-Category, Sales, Quantity, Discount, Profit]
Index: []

In [41]:
# RegionÍ≥º CategoryÎ≥Ñ Ï¥ù ÏàòÏùµ
df.pivot_table(
    values='Profit',
   index= 'Region',
   columns='Category'
)

Category  Furniture  Office Supplies  Technology
Region
Central         NaN       127.093125  128.748889
East       127.6892              NaN         NaN
South           NaN              NaN  138.004800
West       136.2300       138.840000         NaN

In [43]:
df.Region.unique()

array(['East', 'West', 'Central', 'South'], dtype=object)

In [45]:
df.Region.value_counts()

Region
East       25
West       25
Central    25
South      25
Name: count, dtype: int64

In [47]:
df.groupby('Region')['Sales'].sum()

Region
Central    13656.29
East       13656.29
South      14392.01
West       14392.01
Name: Sales, dtype: float64

In [50]:
df['new_order_date'] =  pd.to_datetime(df['Order Date'])

In [63]:
df['year'] = df['new_order_date'].dt.year
df['month'] = df['new_order_date'].dt.month
df['month'].value_counts()

month
1    100
Name: count, dtype: int64